package algorithm.geek;

/**
 * Created by jialei.zou on 2019/4/28 .
 */
public class Week02 {
    /**
     本周做到的比较有代表性的题目是220及692，收获是：
     1. 很多算法实际考察点是建立在一些现有算法和数据结构的基础上的，这就使得在实现的时候，我们可以使用一些工具类，
     例如692题目里面可以使用集合类的排序或优先级队列来进行实现，这样就能专注与目前考察的知识点，同时，这也要求必须对一些
     常用的数据结构和算法的使用做到了解和熟练应用（工程中更是如此），220题目树结构及找树中大于某节点的最小值方法和小于某
     节点的最大值的方法，都和上述相关，如果之前有了解，解决问题上就会有基础；相应的还可以补充堆的一些常用方法等；
     2. 做题时候的思维拓展，自己也可以想一些变种，然后想一下实现，最后对比一下现有实现，类似二分查找，变种有找第一个小于等于某key的位置，
     相同的，有序二叉树中也可以有相同的操作，找到大于某key的最小值，这也是TreeSet方法里面ceiling的实现，这样能做到比较好的进行思维拓展，
     更好的做到举一反三。


     */
}
